
1. How many copies of the film _Hunchback Impossible_ exist in the inventory system?
2. List all films whose length is longer than the average of all the films.
3. Use subqueries to display all actors who appear in the film _Alone Trip_.
4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.
5. Get name and email from customers from Canada using subqueries. Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.
6. Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted in the most number of films. First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.
7. Films rented by most profitable customer. You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments
8. Customers who spent more than the average payments.

<img src="Labs/img/sakila_db_image.png" alt="Drawing" style="width: 100px;"/>

In [1]:
#setup
import pandas as pd
import getpass
import sqlalchemy as sa

#### connect

In [2]:
driver = 'mysql+pymysql'
user = 'root'
password = getpass.getpass(prompt='Your password:'"")
ip = 'localhost' #'127.0.0.1'

Your password:········

In [5]:
connection_string = f'{driver}://{user}:{password}@{ip}'
db_con = sa.create_engine(connection_string)

### 1. How many copies of the film _Hunchback Impossible_ exist in the inventory system?

In [324]:
db_con.execute("use sakila;")

In [325]:
films ="SELECT * FROM sakila.film"
film = pd.read_sql_query(films, db_con)
film.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [326]:
res_str = "select * from sakila.inventory"
res = pd.read_sql(res_str, db_con)

In [327]:
res.head()

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17
2             3        1         1 2006-02-15 05:09:17
3             4        1         1 2006-02-15 05:09:17
4             5        1         2 2006-02-15 05:09:17

In [328]:
# merge film and inventory tables on key 'film_id'
inv_film = film.merge(res, left_on="film_id", right_on="film_id")

In [329]:
# find the right movie
hunch_movie = inv_film[inv_film["title"].str.startswith("HUNCH")]

### ***answer:***

In [330]:
print('Movie:',hunch_movie.title.unique(),'exist in inventory for',hunch_movie.film_id.count(),'times')
hunch_movie

Movie: ['HUNCHBACK IMPOSSIBLE'] exist in inventory for 6 times

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update_x,inventory_id,store_id,last_update_y
2016,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2017,1,2006-02-15 05:09:17
2017,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2018,1,2006-02-15 05:09:17
2018,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2019,1,2006-02-15 05:09:17
2019,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2020,1,2006-02-15 05:09:17
2020,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2021,2,2006-02-15 05:09:17
2021,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42,2022,2,2006-02-15 05:09:17

### 2. List all films whose length is longer than the average of all the films.

In [331]:
# need all film and lenght
# calculate average of all movies
# use greater than check to find the right movies

movie_query = "select title, length from film"
res = pd.read_sql(movie_query, db_con)

In [332]:
data = res[res['length'] > res['length'].mean()]

In [333]:
# check if result makes sense
res.describe() # mean by 115.27

            length
count  1000.000000
mean    115.272000
std      40.426332
min      46.000000
25%      80.000000
50%     114.000000
75%     149.250000
max     185.000000

In [334]:
data.sort_values(['length'], ascending=False)

                  title  length
181      CONTROL ANTHEM     185
140       CHICAGO NORTH     185
608       MUSCLE BRIGHT     185
871   SWEET BROTHERHOOD     185
816  SOLDIERS EVOLUTION     185
..                  ...     ...
3      AFFAIR PREJUDICE     117
986        WORDS HUNTER     116
542      MADIGAN DORADO     116
462    INSTINCT AIRPORT     116
258          DUCK RACER     116

[489 rows x 2 columns]

### 3. Use subqueries to display all actors who appear in the film _Alone Trip_.

In [335]:
# query film Alone trip
# query actors 
# 'film actor' holds key for actor_id and film_id

# 1 get film_id

In [336]:
res = """select concat(first_name,' ',last_name) as Actor_name from sakila.actor 
where 
    actor_id in (
        select actor_id from sakila.film_actor 
            inner join 
                sakila.film 
            using (film_id) 
                where film_id = 
                    (select film_id from sakila.film
                        where title = 'Alone trip'
                    )
                );"""

In [337]:
pd.read_sql(res, db_con)

         Actor_name
0          ED CHASE
1        KARL BERRY
2          UMA WOOD
3       WOODY JOLIE
4      SPENCER DEPP
5        CHRIS DEPP
6  LAURENCE BULLOCK
7        RENEE BALL

### 4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [338]:
query = """select title from sakila.film
where film_id in 
                (select film_id from sakila.film_category 
                    where category_id = 
                        (select category_id from sakila.category
                            where name = 'Family'
                        )
                );"""

In [339]:
pd.read_sql(query, db_con)

               title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

### 5. Get name and email from customers from Canada using subqueries. Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.

In [341]:
# first using subqueries

In [342]:
query = """
select concat(first_name,' ',last_name) as Name, email from customer where address_id in (
select address_id from address where city_id in (
select city_id from city where country_id = (
select country_id from country where country = 'canada')));
"""

In [343]:
pd.read_sql(query, db_con)

                Name                                 email
0    DERRICK BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1      DARRELL POWER      DARRELL.POWER@sakilacustomer.org
2  LORETTA CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3        CURTIS IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

In [344]:
# second using joints

In [352]:
query = '''
select concat(first_name,' ',last_name) as Name ,email from city 
inner join 
	country
using (country_id)
inner join
	address
using (city_id)
inner join
	customer
using (address_id)
where country = 'canada';

'''

In [353]:
pd.read_sql(query, db_con)

                Name                                 email
0    DERRICK BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1      DARRELL POWER      DARRELL.POWER@sakilacustomer.org
2  LORETTA CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3        CURTIS IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

### 6. Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted in the most number of films. First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.